Repository: DEFRA/epr-frontend-obligationchecker-microservice
Catalog: src/FrontendObligationChecker/Resources/Views/ObligationChecker/SingleQuestion.*.resx
Languages: cy

# question_option_no
source: No
cy: Nac ydw

# question_option_yes
source: Yes
cy: Oes

# SingleQuestion.AmountYouSupply.Header
source: You told us that you:
cy: Dywedasoch wrthym eich bod yn:

# SingleQuestion.AmountYouSupply.QuestionTitle
source: How much packaging in total did you supply or import in these ways, in 2022?
cy: Faint o ddeunydd pacio i gyd wnaethoch chi ei gyflenwi neu ei fewnforio yn y ffyrdd hyn, yn 2022?

# SingleQuestion.AmountYouSupply.QuestionTitleSingular
source: How much packaging in total did you supply or import in this way, in 2022?
cy: Faint o ddeunydd pacio i gyd wnaethoch chi ei gyflenwi neu ei fewnforio fel hyn, yn 2022?

# SingleQuestion.AnnualTurnover.AdditionalDescription1
source: Your answer should include the annual turnover of the parent company and all subsidiary organisations that handle and supply (create, import, distribute or sell) packaging.
cy: Dylai eich ateb gynnwys trosiant blynyddol y rhiant-gwmni a'r holl is-sefydliadau sy'n trin ac yn cyflenwi (creu, mewnforio, dosbarthu neu werthu) pecynnu.

# SingleQuestion.AnnualTurnover.QuestionDescription
source: Refer to your most recent annual accounts.
cy: Cyfeiriwch at eich cyfrifon blynyddol diweddaraf.

# SingleQuestion.AnnualTurnover.QuestionError
source: Tell us what was your organisation's last annual turnover
cy: Dywedwch wrthym beth oedd trosiant blynyddol diwethaf eich sefydliad

# SingleQuestion.AnnualTurnover.QuestionOptionLabel1
source: Under £1 million
cy: O dan £1 miliwn

# SingleQuestion.AnnualTurnover.QuestionOptionLabel2
source: £1 million to £2 million
cy: rhwng £1 miliwn a £2 filiwn

# SingleQuestion.AnnualTurnover.QuestionOptionLabel3
source: £2 million or more
cy: £2 filiwn neu fwy

# SingleQuestion.AnnualTurnover.Title1
source: What was your group's last annual turnover?
cy: Beth oedd trosiant blynyddol diwethaf eich grŵp?

# SingleQuestion.AnnualTurnover.Title2
source: What was your organisation's last annual turnover?
cy: Beth oedd trosiant blynyddol diwethaf eich sefydliad?

# SingleQuestion.ContainerVolume.QuestionDescription
source: This includes containers between 50ml and 3l that are sold in multipacks.
cy: Mae hyn yn cynnwys cynwysyddion rhwng 50ml a 3l sy'n cael eu gwerthu mewn pecynnau lluosog.

# SingleQuestion.ContainerVolume.QuestionError
source: Tell is if this includes containers between 50ml and 3l that are sold in multipacks.
cy: Dywedwch a yw hyn yn cynnwys cynwysyddion rhwng 50ml a 3l sy'n cael eu gwerthu mewn pecynnau lluosog.

# SingleQuestion.ContainerVolume.Title
source: Are any of the containers between 50ml and 3l?
cy: A oes unrhyw un o'r cynwysyddion rhwng 50ml a 3l?

# SingleQuestion.HiringLoaning.AlternateTitle
source: hiring or loaning out reusable packaging to UK organisations
cy: llogi neu fenthyca deunydd pacio y gellir ei ailddefnyddio i sefydliadau yn y DU

# SingleQuestion.HiringLoaning.PackagingHireLoanDescriptions
source: <p class="govuk-body">Some organisations hire or loan out reusable packaging, such as wooden pallets, to other organisations for transporting or protecting goods. The packaging is returned after use and loaned out again.</p>
cy: <p class="govuk-body">Mae rhai sefydliadau'n llogi neu'n benthyca pecynnau y gellir eu hailddefnyddio, megis paledi pren, i sefydliadau eraill ar gyfer cludo neu ddiogelu nwyddau. Mae'r pecyn yn cael ei ddychwelyd ar ôl ei ddefnyddio a'i fenthyg eto.</p>

# SingleQuestion.HiringLoaning.QuestionError
source: Select yes if you hire or loan out reusable packaging to UK organisations?
cy: Dewiswch ie os ydych yn llogi neu’n rhoi benthyg deunydd pacio y gellir ei ailddefnyddio i sefydliadau yn y DU?

# SingleQuestion.HiringLoaning.Title
source: Hiring or loaning out reusable packaging
cy: Llogi neu fenthyg deunydd pacio y gellir ei ailddefnyddio

# SingleQuestion.ImportingProducts.AlternateTitle
source: importing products in packaging
cy: mewnforio cynhyrchion mewn pecynnu

# SingleQuestion.ImportingProducts.PackagingImportDescriptions
source: <p class="govuk-body">You'll be classed as an organisation that imports packaging if you import products from outside the UK that are in packaging and go on to supply these products to the UK market.</p> <p class="govuk-body">You'll also be classed as an organisation that imports packaging if you discard the packaging in the UK before supplying the goods.</p> <p class="govuk-body">You aren't classed as an organisation that imports products in packaging if you import filled packaging that is:</p> <ul class="govuk-list govuk-list--bullet"> <li>branded, and you've imported it on behalf of a brand owner that is established in the UK</li> <li>unbranded, and you go on to supply it to a 'large' organisation that applies its brand before supplying it on</li> </ul> <p class="govuk-body"><a href="https://www.gov.uk/guidance/packaging-waste-prepare-for-extended-producer-responsibility#what-you-may-need-to-do" class="govuk-link" target="_blank">Find out what's classed as a 'large' organisation (opens in a new tab)</a></p>
cy: <p class="govuk-body">Byddwch yn cael eich dosbarthu fel sefydliad sy'n mewnforio deunydd pacio os ydych yn mewnforio cynhyrchion o'r tu allan i'r DU sydd mewn pecynnau ac yn mynd ymlaen i gyflenwi'r cynhyrchion hyn i farchnad y DU.</p> <p class="govuk-body">Byddwch hefyd yn cael eich dosbarthu fel sefydliad sy'n mewnforio deunydd pacio os byddwch yn taflu'r pecyn yn y DU cyn cyflenwi'r nwyddau.</p> <p class="govuk-body">Nid ydych yn cael eich ystyried yn sefydliad sy'n mewnforio cynhyrchion mewn pecynnau os ydych yn mewnforio deunydd pacio wedi'i lenwi sydd:</p> <ul class="govuk-list govuk-list--bullet"> <li>wedi'i frandio, ac rydych chi wedi'i fewnforio ar ran perchennog brand sydd wedi'i sefydlu yn y DU</li> <li>heb frand, ac rydych yn mynd ymlaen i'w gyflenwi i sefydliad 'mawr' sy'n cymhwyso ei frand cyn ei gyflenwi</li> </ul> <p class="govuk-body"><a href="https://www.gov.uk/guidance/packaging-waste-prepare-for-extended-producer-responsibility#what-you-may-need-to-do" class="govuk-link" target="_blank">Darganfod beth sy'n cael ei ystyried yn sefydliad 'mawr' (yn agor mewn tab newydd)</a></p>

# SingleQuestion.ImportingProducts.QuestionError
source: Select yes if you import packaging that contains goods into the UK?
cy: Dewiswch ie os ydych yn mewnforio deunydd pacio sy'n cynnwys nwyddau i'r DU?

# SingleQuestion.ImportingProducts.Title
source: Importing products in packaging
cy: Mewnforio cynhyrchion mewn pecynnu

# SingleQuestion.MaterialsForDrinksContainers.AluminiumCans
source: Aluminium
cy: Alwminiwm

# SingleQuestion.MaterialsForDrinksContainers.GlassBottles
source: Glass
cy: Gwydr

# SingleQuestion.MaterialsForDrinksContainers.None
source: None of the above
cy: Dim un o'r uchod

# SingleQuestion.MaterialsForDrinksContainers.PlasticBottles
source: Polyethylene terephthalate (PET) plastic
cy: Plastig polyethylen terephthalate (PET).

# SingleQuestion.MaterialsForDrinksContainers.QuestionDescription
source: Select all that apply
cy: Dewiswch bob un sy'n berthnasol

# SingleQuestion.MaterialsForDrinksContainers.QuestionError
source: Tell us do you use any of the following materials for the drinks containers?
cy: Dywedwch wrthym a ydych chi'n defnyddio unrhyw un o'r deunyddiau canlynol ar gyfer y cynwysyddion diodydd?

# SingleQuestion.MaterialsForDrinksContainers.QuestionTitle
source: Do you use any of the following materials for the drinks containers?
cy: Ydych chi'n defnyddio unrhyw un o'r deunyddiau canlynol ar gyfer y cynwysyddion diodydd?

# SingleQuestion.MaterialsForDrinksContainers.SteelCans
source: Steel
cy: Dur

# SingleQuestion.MaterialsForDrinksContainers.Title
source: Do you use any of the following materials for the drinks containers?
cy: Ydych chi'n defnyddio unrhyw un o'r deunyddiau canlynol ar gyfer y cynwysyddion diodydd?

# SingleQuestion.OnlineMarketplace.AlternateTitle
source: owning an online marketplace
cy: bod yn berchen ar farchnad ar-lein

# SingleQuestion.OnlineMarketplace.OnlineMarketplaceDescriptions
source: <p class="govuk-body">Under EPR for packaging, this is when you operate a website or app that allows non-UK businesses to sell their goods into the UK.</p> <p class="govuk-body">If your organisation owns a website or app that sells goods from UK organisations only, this is not classed as owning an online marketplace.</p>
cy: <p class="govuk-body">O dan EPR ar gyfer pecynnu, dyma pan fyddwch yn gweithredu gwefan neu ap sy'n caniatáu i fusnesau nad ydynt yn dod o'r DU werthu eu nwyddau i'r DU.</p> <p class="govuk-body">Os yw'ch sefydliad yn berchen ar wefan neu ap sy'n gwerthu nwyddau gan sefydliadau yn y DU yn unig, nid yw hyn yn cael ei ddosbarthu fel bod yn berchen ar farchnad ar-lein.</p>

# SingleQuestion.OnlineMarketplace.QuestionError
source: Select yes if you own an online marketplace that allows non-UK organisations to sell packaged products in the UK?
cy: Dewiswch ie os ydych yn berchen ar farchnad ar-lein sy'n caniatáu i sefydliadau y tu allan i'r DU werthu cynhyrchion wedi'u pecynnu yn y DU?

# SingleQuestion.OnlineMarketplace.Title
source: Owning an online marketplace
cy: Bod yn berchen ar farchnad ar-lein

# SingleQuestion.OwnBrand.AlternateTitle
source: supplying goods to the UK market under your own brand
cy: cyflenwi nwyddau i farchnad y DU o dan eich brand eich hun

# SingleQuestion.OwnBrand.AnotherOrganisationTasks
source: <p class="govuk-body">You supply goods under your own brand even if you pay or license another company to do any of the following for you:</p> <ul class="govuk-list govuk-list--bullet"> <li>produce goods that will be sold under your brand name</li> <li>pack goods that will be sold under your brand name</li> <li>place your branded goods on the UK market</li> <li>import goods for you</li> </ul>
cy: <p class="govuk-body">Rydych chi'n cyflenwi nwyddau o dan eich brand eich hun hyd yn oed os ydych chi'n talu neu'n trwyddedu cwmni arall i wneud unrhyw un o'r canlynol ar eich rhan:</p> <ul class="govuk-list govuk-list--bullet"> <li>cynhyrchu nwyddau a fydd yn cael eu gwerthu o dan eich enw brand</li> <li>pecyn nwyddau a fydd yn cael eu gwerthu o dan eich enw brand</li> <li>rhoi eich nwyddau brand ar farchnad y DU</li> <li>mewnforio nwyddau i chi</li> </ul>

# SingleQuestion.OwnBrand.BrandDescriptions
source: <p class="govuk-body">This is when packaged goods labelled with your brand are supplied to the UK market.</p> <p class="govuk-body">A brand includes any of the following:</p> <ul class="govuk-list govuk-list--bullet"> <li>a name</li> <li>a trademark</li> <li>any distinguishing mark</li> </ul>
cy: <p class="govuk-body">Dyma pryd mae nwyddau wedi'u pecynnu sydd wedi'u labelu â'ch brand yn cael eu cyflenwi i farchnad y DU.</p> <p class="govuk-body">Mae brand yn cynnwys unrhyw un o'r canlynol:</p> <ul class="govuk-list govuk-list--bullet"> <li>enw</li> <li>nod masnach</li> <li>unrhyw farc gwahaniaethol</li> </ul>

# SingleQuestion.OwnBrand.QuestionError
source: Select yes if you supply goods to the UK market in primary, secondary, or shipment packaging under your own brand
cy: Dewiswch ie os ydych yn cyflenwi nwyddau i farchnad y DU mewn pecynnau cynradd, eilaidd neu gludo nwyddau o dan eich brand eich hun

# SingleQuestion.OwnBrand.Title
source: Supplying goods to the UK market under your own brand
cy: Cyflenwi nwyddau i farchnad y DU o dan eich brand eich hun

# SingleQuestion.PlaceDrinksOnMarket.Error
source: Tell us if you place drinks on the market in England, Wales or Northern Ireland in single-use containers?
cy: Dywedwch wrthym a ydych yn rhoi diodydd ar y farchnad yng Nghymru, Lloegr neu Ogledd Iwerddon mewn cynwysyddion untro?

# SingleQuestion.PlaceDrinksOnMarket.ScotlandDetail
source: <p class="govuk-body">From August 2023, Scotland will operate a Deposit Return Scheme.</p> <p class="govuk-body">This may affect organisations that place drinks on the market in Scotland.</p> <a href="https://www.sepa.org.uk/regulations/waste/deposit-return-scheme/producers/" class="govuk-link" target="_blank">Find out more about Scotland's Deposit Return Scheme (opens in new tab)</a>
cy: <p class="govuk-body">O fis Awst 2023, bydd yr Alban yn gweithredu Cynllun Dychwelyd Ernes.</p> <p class="govuk-body">Gall hyn effeithio ar sefydliadau sy’n rhoi diodydd ar y farchnad yn yr Alban.</p> <a href="https://www.sepa.org.uk/regulations/waste/deposit-return-scheme/producers/" class="govuk-link" target="_blank">Darganfod mwy am Gynllun Dychwelyd Ernes yr Alban (yn agor mewn tab newydd)</a>

# SingleQuestion.PlaceDrinksOnMarket.ScotlandSummary
source: What to do if you place drinks on the market in Scotland
cy: Beth i'w wneud os rhowch ddiodydd ar y farchnad yn yr Alban

# SingleQuestion.PlaceDrinksOnMarket.Title
source: Do you place drinks on the market in England, Wales or Northern Ireland in single-use containers?
cy: A ydych yn rhoi diodydd ar y farchnad yng Nghymru, Lloegr neu Ogledd Iwerddon mewn cynwysyddion untro?

# SingleQuestion.SellingEmptyPackaging.AlternateTitle
source: supplying empty packaging to businesses that fall under the higher threshold
cy: cyflenwi deunydd pacio gwag i fusnesau sy'n dod o dan y trothwy uwch

# SingleQuestion.SellingEmptyPackaging.HigherThresholdDescriptions
source: <p class="govuk-body">This means manufacturing or importing empty packaging and supplying it to a business that is <span class="govuk-!-font-weight-bold">not</span> classed as a 'large' organisation.</p> <p class="govuk-body">Large organisations: </p> <ul class="govuk-list govuk-list--bullet"> <li>have an annual turnover of £2 million or more </li> <li>supply or import more than 50 tonnes of empty packaging or packaged goods</li> </ul>
cy: <p class="govuk-body">Mae hyn yn golygu gweithgynhyrchu neu fewnforio deunydd pacio gwag a'i gyflenwi i fusnes sydd <span class="govuk-!-font-weight-bold">not</span> cael ei ddosbarthu fel sefydliad 'mawr'.</p> <p class="govuk-body">Sefydliadau mawr: </p> <ul class="govuk-list govuk-list--bullet"> <li>â throsiant blynyddol o £2 filiwn neu fwy</li> <li>cyflenwi neu fewnforio mwy na 50 tunnell o ddeunydd pacio gwag neu nwyddau wedi'u pecynnu</li> </ul>

# SingleQuestion.SellingEmptyPackaging.QuestionError
source: Select yes if you sell empty packaging to businesses with higher threshold?
cy: Dewiswch ie os ydych yn gwerthu deunydd pacio gwag i fusnesau sydd â throthwy uwch?

# SingleQuestion.SellingEmptyPackaging.Title
source: Supplying empty packaging
cy: Cyflenwi deunydd pacio gwag

# SingleQuestion.SupplyingFilledPackaging.AlternateTitle
source: supplying filled packaging to individual customers
cy: cyflenwi pecynnau wedi'u llenwi i gwsmeriaid unigol

# SingleQuestion.SupplyingFilledPackaging.QuestionError
source: Select yes if you supply filled packaging to individual customers?
cy: Dewiswch ie os ydych yn cyflenwi deunydd pacio wedi'i lenwi i gwsmeriaid unigol?

# SingleQuestion.SupplyingFilledPackaging.SupplierConsumerDescriptions
source: <p class="govuk-body">This refers to any organisations that supply filled packaging directly to individual customers in the UK, where they are the end user of the packaging.</p> <p class="govuk-body">It does not refer to filled packaging supplied to businesses.</p>
cy: <p class="govuk-body">Mae hyn yn cyfeirio at unrhyw sefydliadau sy'n cyflenwi pecynnau wedi'u llenwi yn uniongyrchol i gwsmeriaid unigol yn y DU, lle mai nhw yw defnyddiwr terfynol y pecyn.</p> <p class="govuk-body">Nid yw'n cyfeirio at becynnu wedi'i lenwi a gyflenwir i fusnesau.</p>

# SingleQuestion.SupplyingFilledPackaging.Title
source: Supplying filled packaging to individual customers
cy: Cyflenwi deunydd pacio wedi'i lenwi i gwsmeriaid unigol

# SingleQuestion.TypeOfOrganisation.Detail
source: <p class="govuk-body">For parent companies and their subsidiaries, there are different ways you can comply with EPR for packaging. You can register as:</p> <ul class="govuk-list govuk-list--bullet"> <li>a whole group (in this instance, the parent group complies with EPR for packaging on behalf of every subsidiary within the group)</li> <li>individual subsidiaries (in this instance, the subsidiaries that meet the turnover and tonnage requirements comply with EPR for packaging independently)</li> <li>a parent company for part of the group (this is where the parent company registers to comply with EPR for packaging on behalf of some, but not all of its subsidiaries)</li> </ul> <p class="govuk-body">You should register as a parent company for part of the group if some of your subsidiaries don't meet the turnover and tonnage requirements in their own right, but do meet the requirements when combined. In this instance, the parent company will comply with EPR for packaging on behalf of the combined subsidiaries.</p>
cy: <p class="govuk-body">Ar gyfer rhiant-gwmnïau a'u his-gwmnïau, mae yna wahanol ffyrdd y gallwch gydymffurfio ag EPR ar gyfer pecynnu. Gallwch gofrestru fel:</p> <ul class="govuk-list govuk-list--bullet"> <li>grŵp cyfan (yn yr achos hwn, mae’r rhiant grŵp yn cydymffurfio ag EPR ar gyfer pecynnu ar ran pob is-gwmni o fewn y grŵp)</li> <li>is-gwmnïau unigol (yn yr achos hwn, mae’r is-gwmnïau sy’n bodloni’r gofynion trosiant a thunelledd yn cydymffurfio ag EPR ar gyfer pecynnu’n annibynnol)</li> <li>rhiant-gwmni ar gyfer rhan o’r grŵp (dyma lle mae’r rhiant-gwmni yn cofrestru i gydymffurfio ag EPR ar gyfer pecynnu ar ran rhai, ond nid pob un o’i is-gwmnïau)</li> </ul> <p class="govuk-body">Dylech gofrestru fel rhiant-gwmni ar gyfer rhan o'r grŵp os nad yw rhai o'ch is-gwmnïau yn bodloni'r gofynion trosiant a thunelledd yn eu rhinwedd eu hunain, ond eu bod yn bodloni'r gofynion o'u cyfuno. Yn yr achos hwn, bydd y rhiant-gwmni yn cydymffurfio ag EPR ar gyfer pecynnu ar ran yr is-gwmnïau cyfun.</p>

# SingleQuestion.TypeOfOrganisation.QuestionDescription
source: Parent companies (sometimes called a holding company) own groups. Subsidiaries are the separate organisations that form a group.
cy: Mae rhiant-gwmnïau (a elwir weithiau yn gwmni daliannol) yn berchen ar grwpiau. Is-gwmnïau yw'r sefydliadau ar wahân sy'n ffurfio grŵp.

# SingleQuestion.TypeOfOrganisation.QuestionError
source: Tell us what type of organisation are you
cy: Dywedwch wrthym pa fath o sefydliad ydych chi

# SingleQuestion.TypeOfOrganisation.QuestionOptionLabel1
source: Parent company
cy: Rhiant-gwmni

# SingleQuestion.TypeOfOrganisation.QuestionOptionLabel2
source: Subsidiary
cy: Is-gwmni

# SingleQuestion.TypeOfOrganisation.QuestionOptionLabel3
source: Individual company
cy: Cwmni unigol

# SingleQuestion.TypeOfOrganisation.Summary
source: How EPR for packaging affects parent companies and subsidiaries
cy: Sut mae EPR ar gyfer pecynnu yn effeithio ar riant-gwmnïau ac is-gwmnïau

# SingleQuestion.TypeOfOrganisation.Title
source: What type of organisation are you?
cy: Pa fath o sefydliad ydych chi?

# SingleQuestion.UnbrandedPackaging.AlternateTitle
source: placing goods into packaging that's unbranded when it's supplied
cy: gosod nwyddau mewn pecynnau sydd heb eu brandio pan gaiff ei gyflenwi

# SingleQuestion.UnbrandedPackaging.PlacingGoodsDescriptions
source: <p class="govuk-body">This is when you place goods into packaging and that packaging is unbranded when it's supplied. This could be goods you packaged for your own organisation or for another organisation.</p>
cy: <p class="govuk-body">Dyma pan fyddwch chi'n gosod nwyddau mewn pecynnau a'r pecynnu hwnnw heb frand pan gaiff ei gyflenwi. Gallai hyn fod yn nwyddau y gwnaethoch eu pecynnu ar gyfer eich sefydliad eich hun neu ar gyfer sefydliad arall.</p>

# SingleQuestion.UnbrandedPackaging.QuestionError
source: Select yes if you place goods into unbranded packaging
cy: Dewiswch ie os ydych chi'n gosod nwyddau mewn pecynnau heb frand

# SingleQuestion.UnbrandedPackaging.Title
source: Placing goods into packaging that's unbranded when it's supplied
cy: Rhoi nwyddau mewn deunydd pacio sydd heb ei frandio pan gaiff ei gyflenwi

# SingleQuestion.YourPackagingActivities
source: Your packaging activities
cy: Eich gweithgareddau pecynnu

# SingleQuestion.YouToldUsHeader
source: You told us that you:
cy: Dywedasoch wrthym eich bod yn:
