Repository: DEFRA/epr-frontend-obligationchecker-microservice
Catalog: src/FrontendObligationChecker/Resources/Views/ObligationChecker/WhatYouNeedToDo.*.resx
Languages: cy

# WhatYouNeedToDo.AmountYouSupplyAlternateRowTitle
source: Packaging amount
cy: Swm y pecynwaith

# WhatYouNeedToDo.AnnualTurnoverAlternateRowTitle
source: Turnover
cy: Trosiant

# WhatYouNeedToDo.ContainerVolumeAlternateRowTitle
source: Drinks containers between 50ml and 3l
cy: Cynwysyddion diodydd rhwng 150ml a 3l

# WhatYouNeedToDo.ContentBanner
source: You will need to report packaging data
cy: Bydd angen i chi roi gwybod am ddata pecynnu

# WhatYouNeedToDo.ContentHeading1
source: What this means for your organisation
cy: Beth mae hyn yn ei olygu i'ch sefydliad chi

# WhatYouNeedToDo.ContentHeading5
source: What you told us
cy: Yr hyn rydych chi wedi'i ddweud wrthon ni

# WhatYouNeedToDo.ContentNationDataHeading
source: Submit nation data <IF NATION DATA IS APPLICABLE>
cy: Cyflwyno data gwlad

# WhatYouNeedToDo.ContentNationDataInset1
source: You'll need to submit your nation data for the 2024 calendar year by 1 December 2025.
cy: <a href="" target="_blank" > Mewngofnodi i'ch cyfrif EPR </a> neu <a href="https://www.gov.uk/guidance/report-packaging-data" target="_blank" > greu cyfrif </a>

# WhatYouNeedToDo.ContentNationDataParagraph1
source: You will need to submit nation data.
cy: Bydd angen ichi gyflwyno data gwlad.

# WhatYouNeedToDo.ContentNationDataParagraph2
source: Nation data is information about which nation in the UK packaging is supplied in and which nation in the UK packaging is discarded in.
cy: Data gwlad yw gwybodaeth am ba wlad yn y Deyrnas Unedig rydych chi:

# WhatYouNeedToDo.ContentParagraph1Large
source: Under EPR for packaging, you're classed as a large organisation. This means you will need to record and submit data about the packaging you import and supply.
cy: O dan yr EPR dros becynwaith, rydych chi'n cael eich ystyried yn sefydliad bach. Mae hyn yn golygu y bydd angen ichi gofnodi a chyflwyno data am y pecynwaith rydych chi'n ei fewnforio a'i gyflenwi.

# WhatYouNeedToDo.ContentParagraph1Small
source: Under EPR for packaging, you're classed as a small organisation. This means you will need to record and submit data about the packaging you import and supply.
cy: O dan yr EPR dros becynwaith, rydych chi'n cael eich ystyried yn sefydliad bach. Mae hyn yn golygu y bydd angen ichi gofnodi a chyflwyno data am y pecynwaith rydych chi'n ei fewnforio a'i gyflenwi.

# WhatYouNeedToDo.ContentParagraph1SmallParent
source: Under EPR for packaging, you're classed as a small organisation. This means you will need to record and submit data about the packaging you import and supply.
cy: O dan yr EPR dros becynwaith, rydych chi'n cael eich ystyried yn sefydliad mawr. Mae hyn yn golygu y bydd angen ichi gofnodi a chyflwyno data am y pecynwaith rydych chi'n ei fewnforio a'i gyflenwi.

# WhatYouNeedToDo.ContentParagraph2SmallParent
source: As a parent company, you must submit data separately for each of the subsidiaries within your group registration. You do not need to include data for any of your subsidiaries that have registered independently.
cy: Fel rhiant-gwmni, rhaid ichi gyflwyno data ar wahân ar gyfer pob un o'r is-gwmnïau o fewn cofrestriad eich grŵp. Does dim angen ichi gynnwys data ar gyfer unrhyw un neu ragor o'ch is-gwmnïau sydd wedi'u cofrestru'n annibynnol.

# WhatYouNeedToDo.ContentParagraph1LargeParent
source: Under EPR for packaging, you're classed as a large organisation. This means you will need to record and submit data about the packaging you import and supply.
cy: O dan yr EPR dros becynwaith, rydych chi'n cael eich ystyried yn sefydliad mawr. Mae hyn yn golygu y bydd angen ichi gofnodi a chyflwyno data am y pecynwaith rydych chi'n ei fewnforio a'i gyflenwi.

# WhatYouNeedToDo.ContentParagraph2LargeParent
source: As a parent company, you must submit data separately for each of the subsidiaries within your group registration. You do not need to include data for any of your subsidiaries that have registered independently.
cy: Fel rhiant-gwmni, rhaid ichi gyflwyno data ar wahân ar gyfer pob un o'r is-gwmnïau o fewn cofrestriad eich grŵp. Does dim angen ichi gynnwys data ar gyfer unrhyw un neu ragor o'ch is-gwmnïau sydd wedi'u cofrestru'n annibynnol.

# WhatYouNeedToDo.ContentParagraph1SmallSubsidiary
source: Under EPR for packaging, you're classed as a small organisation. This means you will need to record and submit data about the packaging you import and supply.
cy: O dan yr EPR dros becynwaith, rydych chi'n cael eich ystyried yn sefydliad mawr. Mae hyn yn golygu y bydd angen ichi gofnodi a chyflwyno data am y pecynwaith rydych chi'n ei fewnforio a'i gyflenwi.

# WhatYouNeedToDo.ContentParagraph2SmallSubsidiary
source: As a subsidiary, your parent company may need to report data on your behalf if it’s classed as a large organisation. Sign in to your EPR account or create an account
cy: Fel is-gwmni, efallai y bydd angen i'ch rhiant-gwmni roi gwybod am ddata ar eich rhan os yw e hefyd yn cael ei ystyried yn sefydliad mawr.

# WhatYouNeedToDo.ContentParagraph2Large
source: <p class="govuk-body">You must:</p> <ul class="govuk-list govuk-list--bullet"> <li>record data about empty packaging and packaged goods you import and supply in the UK market from 1 January 2024</li> <li><a href="https://www.gov.uk/guidance/report-packaging-data" target="_blank">create an account</a> and register your organisation by 1 April 2025</li> <li>pay a fee to the environmental regulator - contact your UK country’s regulator for more information about fees</li> <li>submit data about empty packaging and packaged goods you imported or supplied through the UK market every six months</li> </ul>
cy: <p class="govuk-body">Mae'n rhaid ichi:</p> <ul class="govuk-list govuk-list--bullet"> <li>cofnodi data am becynwaith gwag a nwyddau wedi'u pecynnu rydych chi'n eu mewnforio a'u cyflenwi ym marchnad y Deyrnas Unedig o 1 Ionawr 2024 ymlaen</li> <li><a href="https://www.gov.uk/guidance/report-packaging-data" target="_blank">creu cyfrif</a> a chofrestru'ch sefydliad erbyn 1 Ebrill 2025</li> <li>talu ffi i'r rheoleiddiwr amgylcheddol - cysylltwch â rheoleiddiwr eich gwlad chi yn y Deyrnas Unedig i gael rhagor o wybodaeth am ffioedd </li> <li>cyflwyno data am becynwaith gwag a nwyddau wedi'u pecynnu rydych chi wedi'u mewnforio neu wedi'u cyflenwi drwy farchnad y Deyrnas Unedig </li> </ul>

# WhatYouNeedToDo.ContentParagraph1LargeSubsidiary
source: Under EPR for packaging, you're classed as a large organisation. This means you’ll need to record and submit data about the packaging you import and supply.
cy: O dan yr dros becynwaith, rydych chi'n cael eich ystyried yn sefydliad mawr. Mae hyn yn golygu y bydd angen ichi gofnodi a chyflwyno data am y pecynwaith rydych chi'n ei fewnforio a'i gyflenwi.

# WhatYouNeedToDo.ContentParagraph2LargeSubsidiary
source: As a subsidiary, your parent company may need to report data on your behalf if it's also classed as a large organisation. Sign in to your EPR account or create an account.
cy: Fel is-gwmni, efallai y bydd angen i'ch rhiant-gwmni roi gwybod am ddata ar eich rhan os yw e hefyd yn cael ei ystyried yn sefydliad mawr.

# WhatYouNeedToDo.ContentParagraph2Small
source: <p class="govuk-body">You must:</p> <ul class="govuk-list govuk-list--bullet"> <li>record data about empty packaging and packaged goods you import and supply in the UK market from 1 January 2024</li> <li><a href="https://www.gov.uk/guidance/report-packaging-data" target="_blank">create an account</a> and register your organisation by 1 April 2025</li> <li>pay a fee to the environmental regulator - contact your UK nation's regulator for more information about fees</li> <li>submit data about empty packaging and packaged goods you imported or supplied through the UK market throughout 2024</li> </ul>
cy: <p class="govuk-body">Mae'n rhaid ichi:</p> <ul class="govuk-list govuk-list--bullet"> <li>cofnodi data am becynwaith gwag a nwyddau wedi'u pecynnu rydych chi'n eu mewnforio a'u cyflenwi ym marchnad y Deyrnas Unedig o 1 Ionawr 2024 ymlaen</li> <li><a href="https://www.gov.uk/guidance/report-packaging-data" target="_blank">creu cyfrif</a> a chofrestru'ch sefydliad erbyn 1 Ebrill 2025</li> <li>talu ffi i'r rheoleiddiwr amgylcheddol - cysylltwch â rheoleiddiwr eich gwlad chi yn y Deyrnas Unedig i gael rhagor o wybodaeth am ffioedd </li> <li>cyflwyno data am becynwaith gwag a nwyddau wedi'u pecynnu rydych chi wedi'u mewnforio neu wedi'u cyflenwi drwy farchnad y Deyrnas Unedig </li> </ul>

# WhatYouNeedToDo.ContentPrint1
source: You can
cy: Gallwch

# WhatYouNeedToDo.ContentPrint2
source: print or save this page as a PDF
cy: argraffu'r tudalen yma neu ei gadw fel PDF

# WhatYouNeedToDo.HiringLoaning.AlternateRowTitle
source: Do you hire or loan out reusable packaging to UK organisations?
cy: Ydych chi'n llogi neu'n rhoi benthyg pecynwaith a all gael ei ailddefnyddio i sefydliadau yn y Deyrnas Unedig?

# WhatYouNeedToDo.ImportingProducts.AlternateRowTitle
source: Do you import packaged goods to supply to the UK market?
cy: Ydych chi'n mewnforio nwyddau wedi'u pecynnu i'w cyflenwi i farchnad y Deyrnas Unedig?

# WhatYouNeedToDo.MaterialsForDrinksContainersAlternateRowTitle
source: Materials used for drinks containers
cy: Deunyddiau a ddefnyddir ar gyfer cynwysyddion diodydd

# WhatYouNeedToDo.OnlineMarketplace.AlternateRowTitle
source: Do you own an online maketplace allowing non-UK companies to sell packaged goods in the UK?
cy: Ydych chi'n berchen ar farchnad ar-lein sy'n caniatáu i gwmnïau o'r tu allan i'r Deyrnas Unedig werthu nwyddau sydd wedi'u pecynnu yn y Deyrnas Unedig?

# WhatYouNeedToDo.OrganisationTypeAlternateRowTitle
source: Organisation type
cy: Math o sefydliad

# WhatYouNeedToDo.PlaceDrinksOnMarketAlternateRowTitle
source: Place drinks containers on the market
cy: Rhowch gynwysyddion diodydd ar y farchnad

# WhatYouNeedToDo.TypeOfProducerLarge
source: Large
cy: mawr

# WhatYouNeedToDo.TypeOfProducerSmall
source: Small
cy: bach

# WhatYouNeedToDo.TypeOfProducerText
source: Organisation size
cy: Maint y sefydliad
