Repository: DEFRA/epr-frontend-obligationchecker-microservice
Catalog: src/FrontendObligationChecker/Resources/Views/LargeProducerRegister/LargeProducerRegister.*.resx
Languages: cy

# LargeProducerRegister.Title
source: Public list of large producers on the ‘report packaging data’ service
cy: Rhestr gyhoeddus o gynhyrchwyr mawr sy’n rhan o’r gwasanaeth ‘rhoi gwybod am ddata pecynwaith’

# LargeProducerRegister.BeforeYouStart
source: Before you start,
cy: Cyn i chi ddechrau,

# LargeProducerRegister.FindOutWhatThisLinkIsForLink
source: find out what this list is for and how to use it
cy: dysgwch beth yw pwrpas y rhestr hon a sut i’w defnyddio

# LargeProducerRegister.ForAnythingBeforeReportingYear
source: For anything before reporting year 2023, use the
cy: Ar gyfer unrhyw beth cyn blwyddyn adrodd 2023, defnyddiwch y

# LargeProducerRegister.PublicRegisterOfRegisteredProducersLink
source: Public Register of Registered Producers on the National Packaging Waste Database (NPWD)
cy: Gofrestr Gyhoeddus o Gynhyrchwyr Cofrestredig ar y Gronfa Ddata Genedlaethol ar gyfer Gwastraff Pecynwaith (NPWD)

# LargeProducerRegister.ListOfLargeProducers
source: List of large producers - download the CSV file
cy: Rhestr o gynhyrchwyr mawr - llwythwch y ffeil CSV i lawr

# LargeProducerRegister.TheInformationIsInCsvFiles
source: The information contained in the CSV file is for all nations – England, Scotland, Wales and Northern Ireland
cy: Mae’r wybodaeth yn y ffeil CSV hon yn berthnasol i bob gwlad – Cymru, Lloegr, yr Alban a Gogledd Iwerddon

# LargeProducerRegister.EnglandLink
source: Environment Agency - England (CSV, {0})
cy: Asiantaeth yr Amgylchedd (Lloegr) (CSV, {0})

# LargeProducerRegister.NorthernIrelandLink
source: Northern Ireland Environment Agency (CSV, {0})
cy: Asiantaeth Amgylchedd Gogledd Iwerddon (CSV, {0})

# LargeProducerRegister.ScotlandLink
source: Scottish Environment Protection Agency (CSV {0})
cy: Asiantaeth Diogelu Amgylchedd yr Alban (CSV, {0})

# LargeProducerRegister.WalesLink
source: Natural Resources Wales (CSV, {0})
cy: Cyfoeth Naturiol Cymru (CSV, {0})

# LargeProducerRegister.ThisInformationIsUpdated
source: This information is updated every day.
cy: Mae’r wybodaeth hon yn cael ei diweddaru bob dydd.

# LargeProducerRegister.AllFourRegulatorsLink
source: All four regulators (CSV, {0})
cy: Pob un o’r pedwar rheoleiddiwr (CSV, {0})

# LargeProducerRegister.Disclaimer
source: Disclaimer
cy: Ymwadiad

# LargeProducerRegister.TheListsShowTheInformation
source: The list shows the information that producers have submitted to the ‘report packaging data’ service. This means that if a producer has submitted errors, the errors will be shown here.
cy: Mae’r rhestr yn dangos yr wybodaeth mae cynhyrchwyr wedi’i chyflwyno i’r gwasanaeth ‘rhoi gwybod am ddata pecynwaith’. Mae hyn yn golygu y bydd gwallau’n ymddangos yma os bydd cynhyrchydd wedi cyflwyno gwallau.

# LargeProducerRegister.SomeFieldsMayBeBlank
source: Some fields may be blank. This could be because they do not apply to the producer in question.
cy: Mae'n bosibl y bydd rhai meysydd yn wag. Efallai am nad ydynt yn berthnasol i’r cynhyrchydd dan sylw.

# LargeProducerRegister.IfYoureUnsureAboutAnything
source: If you’re unsure about anything, check with the producer directly.
cy: Os nad ydych chi’n siŵr am unrhyw beth, cysylltwch â’r cynhyrchydd yn uniongyrchol.

# LargeProducerRegister.ListOfLargeProducersFile
source: List_of_large_producers_to_{0}_{1:dd}_{1:MMMM}_{1:yyyy} (CSV {2})
cy: Rhestr_o_gynhyrchwyr_mawr_{0:dd}_{0:MMMM}_{0:yyyy} (CSV {1})
